Revit 2024 API
DisplacementPathStyle Enumeration
 Used to control the graphical representation of a DisplacementPath element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public enum DisplacementPathStyle
Visual Basic
Public Enumeration DisplacementPathStyle
Visual C++
public enum class DisplacementPathStyle
Members
Member name | Description
Straight |  A single straight line is used to represent each stage of the displacement.
Jogged |  A jogged path consisting of three straight lines is used to represent each stage of the displacement.
See Also
Autodesk.Revit.DB Namespace